// Ukazatel 1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
                                             /*Указатели*/

    char arrayA[15] = "abcdef";
    char arrayB[15];


    char* a = arrayA;
    char* b = arrayB;



    cout << "before loop:" << endl;
    cout << a << endl;
    cout << b << endl;



    while (*a != '\0') {
        // Copy the contents of a into b
        *b = *a;



        // Step
        a++;
        b++;
    }



    // Assign null to the end of arrayB
    *b = '\0';



    cout << "after loop:" << endl;
    cout << a << endl;
    cout << b << endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
